# 学生信息管理项目
# 输入任意学生的姓名，年龄，成绩，每个学生的信息存入字典，然后放入列表
# 每个学生的信息需要手动输入
# 当输入名字为空时结束输入
# 如：
#    请输入姓名：name1
#    请输入年龄：20
#    请输入成绩：88
#    内部储存格式：
#    [{'name':'tarena','age':20,'score':99}
#     {'name':'name22','age':19,'score':98}]:
# 打印表格：
# +--------+------+------+
# |  姓名   | 年龄 | 成绩  |
# +--------+------+------+
# | tarena | 20   |  99  |
# | names  | 18   |  98  |
# +--------+------+------+
L = []
while True:
    n=input('请输入姓名:')
    if n=='':
        break
    a=input('请输入年龄:')
    if a=='':
        break
    s=input('请输入成绩：')
    if s =='':
        break
    d={'name':n,'age':a,'score':s}
    L.append(d)
print("+---------------+-----------+----------+")
print("|     姓名      |    年龄   |   成绩   |")
print("+---------------+-----------+----------+")
for d in L:
    n=d['name']
    a = d['age']
    s = d['score']
    a = str(a)  
    s = str(s)
    print("|" + n.center(15) + '|'
              + a.center(11) + '|'
              + s.center(10) + '|')
print("+---------------+-----------+----------+")