#   1. 北京出租车计价程序
#     收费标准:
#       3公里以内收费13元
#       基本单价 2.3元/公里(超出3公里以外)
#       空驶费: 超过15公里后,每公里加收单价的50%空驶费(即:
#           15公里后为 3.45元/公里)
#     要求:
#       输入公里数,打印出费用金额(以元为单位,精确到分,分以后四舍
#       五入)

km = float(input("请输入公里数: "))
money = 13
# 此处开始计算钱数,修改money变量

# 超过三公里以外1公里多收2.3元
if km > 3:
    money += 2.3 * (km - 3)

if km > 15: 
    money +=  2.3 * .5 * (km - 15)  # 加收空驶费 

# if km <= 3:
#     money = 13
# elif 3 < km <= 15:
#     money = 13 + 2.3 * (km - 3)
# elif km > 15:
#     money =  13 + 2.3 * (km - 3) + 2.3 * .5 * (km - 15)


print("您需要支付:", round(money, 2), '元')